app/controllers/games_controller.rb

SELECT "games".* FROM "games"
---
	def new
		@game = Game.new
		@games = Game.all

INSERT INTO "games" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "dominoes"], ["created_at", "2018-09-23 22:05:28.708493"], ["updated_at", "2018-09-23 22:05:28.708493"]]
---
	def create
		@user = current_user
		@game = @user.games.build(game_params)
		raise @game.errors.inspect
		if @game.save