app/controllers/matches_controller.rb

SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def new
		@game = Game.find(params[:game_id])

SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "matches" ("game_id", "user_id", "match_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["game_id", 1], ["user_id", 1], ["match_date", "2018-09-05"], ["created_at", "2018-09-23 22:10:50.433788"], ["updated_at", "2018-09-23 22:10:50.433788"]]
---
	def create
		@game = Game.find(params[:game_id]) # finding the parent
	    @match = @game.matches.build(match_params)
	    @match.user = current_user

	    if @match.save

SELECT  "matches".* FROM "matches" WHERE "matches"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
	def show
		@match = Match.find(params[:id])