app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."uid" = ? LIMIT ?  [["uid", "10108634025949606"], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "loni@loni.com"], ["LIMIT", 1]]
---
  def create
    if auth
    	 @user = User.find_or_create_by(uid: auth['uid']) do |u|
        u.name = auth['info']['name']
        u.email = auth['info']['email']
        u.image = auth['info']['image']
        u.password = SecureRandom.hex

        session[:user_id] = @user.id
        redirect_to user_path(@user)
      end

  	else
      @user = User.find_by(email: params[:user][:email])