app/controllers/users_controller.rb

INSERT INTO "users" ("name", "password_digest", "created_at", "updated_at", "email") VALUES (?, ?, ?, ?, ?)
---
	def create
		@user = User.new(user_params)

		if @user.save